In [1]:
import pandas as pd
import numpy as np

In [2]:
pymoli = "purchase_data.csv"


pymoli_df = pd.read_csv(pymoli)

pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
players_count = len(pymoli_df["SN"].unique())
players_count

576

In [4]:
Total_Players_df= pd.DataFrame({
                                 "Total Players":[players_count]})

Total_Players_df

   Total Players
0            576

In [5]:
unique_items_count = len(pymoli_df["Item ID"].unique())
unique_items_count

183

In [7]:
average_price = pymoli_df["Price"].mean()

average_price

3.050987179487176

In [8]:
number_of_purchases = pymoli_df["SN"].count()
number_of_purchases

780

In [9]:
total_revenue = pymoli_df["Price"].sum()
 
total_revenue

2379.77

In [10]:
print("Purchasing Analysis (Total)")
purchasing_analysis_table = pd.DataFrame({"Number of Unique Items": [unique_items_count],
                                          "Average Price":[f"${average_price}"],
                                          "Number of Purchases":[number_of_purchases],
                                          "Total Revenue" :[f"${total_revenue}"]})
purchasing_analysis_table

Purchasing Analysis (Total)

,Number of Unique Items,Average Price,Number of Purchases,Total Revenue
0,183,$3.050987179487176,780,$2379.77

In [11]:
grouped_data = pymoli_df.groupby(["Gender"])
grouped_data

In [12]:
gender_count = pymoli_df["Gender"].unique()
gender_count

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [13]:
sum_gender =  grouped_data["Gender"].count()
sum_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [14]:
gender_percentage = (pymoli_df["Gender"].value_counts()/pymoli_df["Gender"].count())*100
gender_percentage.head()

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [15]:
array_gender = pymoli_df["Gender"].value_counts()
array_gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [16]:
print("Gender Demographics")

gender_table = pd.DataFrame({"Total Count":array_gender,
                             "Percentage of Players":gender_percentage})
gender_table.head()

Gender Demographics

                       Total Count  Percentage of Players
Male                           652              83.589744
Female                         113              14.487179
Other / Non-Disclosed           15               1.923077

In [17]:
grouped_data = pymoli_df.groupby(["Gender"])
grouped_data

In [18]:
average_purchase = grouped_data["Price"].mean()
average_purchase

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [19]:
total_purchase_value = grouped_data["Price"].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [20]:
average_total_price = (grouped_data["Price"].mean())*780/576
average_total_price

Gender
Female                   4.337408
Male                     4.086676
Other / Non-Disclosed    4.531042
Name: Price, dtype: float64

In [21]:
print("Purchasing Analysis (Gender)")
purchasing_analysis_gender_table = pd.DataFrame({"Purchase Count":sum_gender,
                                                 "Average Purchase Price": average_purchase, 
                                                 "Total Purchase Value":total_purchase_value, 
                                                 "Avg Total Purchase per Person":average_total_price })
purchasing_analysis_gender_table.head()

Purchasing Analysis (Gender)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.337408
Male,652,3.017853,1967.64,4.086676
Other / Non-Disclosed,15,3.346000,50.19,4.531042

In [22]:
import pandas as pd
import numpy as np

In [23]:
pymoli = "purchase_data.csv"


pymoli_df = pd.read_csv(pymoli)

pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [24]:
pymoli_df
age_bins = [0, 9, 14, 19, 24, 29,34,39,100]


age_names = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [25]:
pymoli_df["Age Demographics"] = pd.cut(pymoli_df["Age"], age_bins, labels = age_names)
pymoli_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Demographics
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,101,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [26]:
pymoli_df = pymoli_df.groupby(["Age Demographics"])
pymoli_df

In [27]:
players_count_age = pymoli_df["Age"].unique()
players_count_age

Age Demographics
<10                     [7, 8, 9]
10-14        [11, 10, 12, 13, 14]
15-19        [19, 18, 17, 15, 16]
20-24        [20, 24, 23, 22, 21]
25-29        [29, 27, 25, 26, 28]
30-34        [30, 33, 32, 34, 31]
35-39        [36, 35, 38, 37, 39]
40+      [40, 44, 41, 42, 43, 45]
Name: Age, dtype: object

In [28]:
age_count = pymoli_df["Age Demographics"].count()
age_count

Age Demographics
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age Demographics, dtype: int64

In [29]:
age_percentage =(pymoli_df["Age Demographics"].count()/780)*100

age_percentage

Age Demographics
<10       2.948718
10-14     3.589744
15-19    17.435897
20-24    46.794872
25-29    12.948718
30-34     9.358974
35-39     5.256410
40+       1.666667
Name: Age Demographics, dtype: float64

In [33]:
print("Age Demographics")

age_demographics_table = pd.DataFrame({"Total Count":age_count,
                             "Percentage of Players":age_percentage })
age_demographics_table.head(8)

Age Demographics

                  Total Count  Percentage of Players
Age Demographics
<10                        23               2.948718
10-14                      28               3.589744
15-19                     136              17.435897
20-24                     365              46.794872
25-29                     101              12.948718
30-34                      73               9.358974
35-39                      41               5.256410
40+                        13               1.666667

In [34]:
age_purchase_count = pymoli_df["Age"].count()
age_purchase_count

Age Demographics
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [35]:
average_purchase_price =pymoli_df["Price"].mean()
average_purchase_price

Age Demographics
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [36]:
total_purchase_value = pymoli_df["Price"].sum()
total_purchase_value

Age Demographics
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [37]:
Avg_Total_Purchase_per_Person =pymoli_df["Price"].mean()*780/576
Avg_Total_Purchase_per_Person

Age Demographics
<10      4.541168
10-14    4.003497
15-19    4.111190
20-24    4.133213
25-29    3.928424
30-34    3.969749
35-39    4.877312
40+      3.983333
Name: Price, dtype: float64

In [41]:
print("Purchasing Analysis (Age)")
purchasing_analysis_gender_table = pd.DataFrame({"Purchase Count":age_purchase_count,
                                                 "Average Purchase Price": average_purchase_price, 
                                                 "Total Purchase Value":total_purchase_value, 
                                                 "Avg Total Purchase per Person":Avg_Total_Purchase_per_Person})
purchasing_analysis_gender_table.head(8)

Purchasing Analysis (Age)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Demographics,,,,
<10,23,3.353478,77.13,4.541168
10-14,28,2.956429,82.78,4.003497
15-19,136,3.035956,412.89,4.111190
20-24,365,3.052219,1114.06,4.133213
25-29,101,2.900990,293.00,3.928424
30-34,73,2.931507,214.00,3.969749
35-39,41,3.601707,147.67,4.877312
40+,13,2.941538,38.24,3.983333

In [42]:
import pandas as pd
import numpy as np

In [43]:
pymoli = "purchase_data.csv"


pymoli_df = pd.read_csv(pymoli)

pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [44]:
top_spenders= pymoli_df[["Purchase ID","SN", "Price"]]
top_spenders.head()

   Purchase ID             SN  Price
0            0        Lisim78   3.53
1            1    Lisovynya38   1.56
2            2     Ithergue48   4.88
3            3  Chamassasya86   3.27
4            4      Iskosia90   1.44

In [45]:
SN_purchase_count = pymoli_df["SN"].value_counts()
SN_purchase_count

Lisosia93       5
Iral74          4
Idastidru52     4
Pheodaisun84    3
Lisopela58      3
               ..
Dyally87        1
Iana95          1
Yasrisu92       1
Frichynde86     1
Lisirra58       1
Name: SN, Length: 576, dtype: int64

In [46]:
SN_pymoli_df = pymoli_df.groupby(["SN"])
SN_pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [47]:
SN_Average_Purchase_Price= SN_pymoli_df["Price"].mean()
SN_Average_Purchase_Price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [48]:
SN_total_Purchase_Value =SN_pymoli_df["Price"].sum()
SN_total_Purchase_Value

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [49]:
print("Top Spenders")
top_spenders_table = pd.DataFrame({"Purchase Count":SN_purchase_count,
                                                 "Average Purchase Price": SN_Average_Purchase_Price, 
                                                 "Total Purchase Value":SN_total_Purchase_Value})

top_spenders_table.head()

Top Spenders

              Purchase Count  Average Purchase Price  Total Purchase Value
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [50]:
print("Top Spenders")
top_spenders_table = top_spenders_table.sort_values("Total Purchase Value", ascending=False)
top_spenders_table.head()

Top Spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [51]:
import pandas as pd
import numpy as np

In [52]:
pymoli = "purchase_data.csv"


pymoli_df = pd.read_csv(pymoli)

pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [53]:
 #Item ID, Item Name, and Item Price
Most_Popular_Items= pymoli_df[["Item ID","Item Name", "Price"]]
Most_Popular_Items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [54]:
ID_and_Name_pymoli_df = pymoli_df.groupby(["Item Name"])
ID_and_Name_pymoli_df .head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
764,764,Saedaiphos46,18,Male,113,Solitude's Reaver,4.07
765,765,Irith83,18,Male,130,Alpha,2.07
766,766,Aelastirin39,23,Male,58,"Freak's Bite, Favor of Holy Might",4.14
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [55]:
ID_and_Name_purchase_count = pymoli_df["Item Name"].value_counts()
ID_and_Name_purchase_count

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Fiery Glass Crusader                             9
Persuasion                                       9
Extraction, Quickblade Of Trembling Hands        9
                                                ..
Undead Crusader                                  1
Gladiator's Glaive                               1
The Decapitator                                  1
Riddle, Tribute of Ended Dreams                  1
Celeste                                          1
Name: Item Name, Length: 179, dtype: int64

In [56]:
ID_and_Name_Average_Purchase_Price= ID_and_Name_pymoli_df["Price"].mean()
ID_and_Name_Average_Purchase_Price

Item Name
Abyssal Shard                      2.67
Aetherius, Boon of the Blessed     3.39
Agatha                             3.08
Alpha                              2.07
Alpha, Oath of Zeal                4.05
                                   ...
Wolf                               3.54
Wolf, Promise of the Moonwalker    4.48
Worldbreaker                       2.60
Yearning Crusher                   4.18
Yearning Mageblade                 3.82
Name: Price, Length: 179, dtype: float64

In [57]:
ID_and_Name_total_Purchase_Value =ID_and_Name_pymoli_df["Price"].sum()
ID_and_Name_total_Purchase_Value

Item Name
Abyssal Shard                      13.35
Aetherius, Boon of the Blessed     16.95
Agatha                             18.48
Alpha                               6.21
Alpha, Oath of Zeal                12.15
                                   ...
Wolf                               28.32
Wolf, Promise of the Moonwalker    26.88
Worldbreaker                       10.40
Yearning Crusher                   12.54
Yearning Mageblade                 19.10
Name: Price, Length: 179, dtype: float64

In [58]:
print("Most Popular Items")
Most_Popular_Items = pd.DataFrame({"Purchase Count":ID_and_Name_purchase_count,
                                    "Average Purchase Price":ID_and_Name_Average_Purchase_Price, 
                                     "Total Purchase Value":ID_and_Name_total_Purchase_Value})

Most_Popular_Items.head()

Most Popular Items

,Purchase Count,Average Purchase Price,Total Purchase Value
Abyssal Shard,5,2.67,13.35
"Aetherius, Boon of the Blessed",5,3.39,16.95
Agatha,6,3.08,18.48
Alpha,3,2.07,6.21
"Alpha, Oath of Zeal",3,4.05,12.15

In [59]:
print("Most Popular Items")
Most_Popular_Items = Most_Popular_Items.sort_values("Purchase Count", ascending=False)
Most_Popular_Items.head()

Most Popular Items

,Purchase Count,Average Purchase Price,Total Purchase Value
Final Critic,13,4.614615,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
Persuasion,9,3.221111,28.99
Nirvana,9,4.900000,44.10
"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [60]:

print("Most Profitable Items")
Most_Popular_Items = Most_Popular_Items.sort_values("Total Purchase Value", ascending=False)
Most_Popular_Items.head()

Most Profitable Items

,Purchase Count,Average Purchase Price,Total Purchase Value
Final Critic,13,4.614615,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
Nirvana,9,4.900000,44.10
Fiery Glass Crusader,9,4.580000,41.22
Singed Scalpel,8,4.350000,34.80